09/10/2018

Get things into data frames

In [1]:
import pandas
import os

DATA_DIR = 'movielens/movielens/'
MOVIES_FILE = os.path.join(DATA_DIR, 'movies.csv')
USERS_FILE = os.path.join(DATA_DIR, 'users.csv')
RATINGS_FILE = os.path.join(DATA_DIR, 'ratings.csv')

m = pandas.read_csv(MOVIES_FILE)
u = pandas.read_csv(USERS_FILE)
r = pandas.read_csv(RATINGS_FILE)

How many genres?  What are they?  What are the top 10 genres?

In [2]:
m.genres.unique()

array(["Animation|Children's|Comedy", "Adventure|Children's|Fantasy",
       'Comedy|Romance', 'Comedy|Drama', 'Comedy',
       'Action|Crime|Thriller', "Adventure|Children's", 'Action',
       'Action|Adventure|Thriller', 'Comedy|Drama|Romance',
       'Comedy|Horror', "Animation|Children's", 'Drama',
       'Action|Adventure|Romance', 'Drama|Thriller', 'Drama|Romance',
       'Thriller', 'Action|Comedy|Drama', 'Crime|Drama|Thriller',
       'Drama|Sci-Fi', 'Romance', 'Adventure|Sci-Fi', 'Adventure|Romance',
       "Children's|Comedy|Drama", 'Documentary', 'Drama|War',
       'Action|Crime|Drama', 'Action|Adventure', 'Crime|Thriller',
       "Animation|Children's|Musical|Romance", 'Action|Drama|Thriller',
       "Children's|Comedy", 'Drama|Mystery', 'Sci-Fi|Thriller',
       'Action|Comedy|Crime|Horror|Thriller', 'Drama|Musical',
       'Crime|Drama|Romance', 'Adventure|Drama', 'Action|Thriller',
       "Adventure|Children's|Comedy|Musical", 'Action|Drama|War',
       'Action|Adventure|Crime', 'Crime', 'Drama|Mystery|Romance',
       'Action|Drama', 'Drama|Romance|War', 'Horror',
       'Action|Adventure|Comedy|Crime', 'Comedy|War',
       'Action|Adventure|Mystery|Sci-Fi', 'Drama|Thriller|War',
       'Action|Romance|Thriller', 'Crime|Film-Noir|Mystery|Thriller',
       'Action|Adventure|Drama|Romance', "Adventure|Children's|Drama",
       'Action|Sci-Fi|Thriller', 'Action|Adventure|Sci-Fi',
       "Action|Children's", 'Horror|Sci-Fi', 'Action|Crime|Sci-Fi',
       'Western', "Animation|Children's|Comedy|Romance",
       "Children's|Drama", 'Crime|Drama',
       'Drama|Fantasy|Romance|Thriller', 'Drama|Horror', 'Comedy|Sci-Fi',
       'Mystery|Thriller', "Adventure|Children's|Comedy|Fantasy|Romance",
       'Action|Adventure|Fantasy|Sci-Fi', 'Drama|Romance|War|Western',
       'Action|Crime', 'Crime|Drama|Romance|Thriller',
       'Action|Adventure|Western', 'Horror|Thriller',
       "Children's|Comedy|Fantasy", 'Film-Noir|Thriller',
       'Action|Comedy|Musical|Sci-Fi', "Children's",
       'Drama|Mystery|Thriller', 'Comedy|Romance|War', 'Action|Comedy',
       "Adventure|Children's|Romance", "Animation|Children's|Musical",
       'Comedy|Crime|Fantasy', 'Action|Comedy|Western', 'Action|Sci-Fi',
       'Action|Adventure|Comedy|Romance', 'Comedy|Crime|Drama',
       'Comedy|Thriller', 'Horror|Sci-Fi|Thriller',
       'Mystery|Romance|Thriller', 'Comedy|Western', 'Drama|Western',
       'Action|Adventure|Crime|Thriller', 'Action|Comedy|War',
       'Comedy|Mystery', 'Comedy|Mystery|Romance', 'Comedy|Drama|War',
       'Action|Drama|Mystery', 'Comedy|Crime|Horror', 'Film-Noir|Sci-Fi',
       'Comedy|Romance|Thriller', "Action|Adventure|Children's|Sci-Fi",
       "Children's|Comedy|Musical", 'Action|Adventure|Comedy',
       'Action|Crime|Romance',
       "Action|Adventure|Animation|Children's|Fantasy",
       "Animation|Children's|Comedy|Musical", 'Adventure|Drama|Western',
       'Action|Adventure|Crime|Drama',
       'Action|Adventure|Animation|Horror|Sci-Fi', 'Action|Horror|Sci-Fi',
       'War', 'Action|Adventure|Mystery', 'Mystery',
       'Action|Adventure|Fantasy',
       "Adventure|Animation|Children's|Comedy|Fantasy", 'Sci-Fi',
       'Documentary|Drama', 'Action|Adventure|Comedy|War',
       'Crime|Film-Noir|Thriller', 'Animation',
       'Action|Adventure|Romance|Thriller', 'Animation|Sci-Fi',
       'Animation|Comedy|Thriller', 'Film-Noir', 'Sci-Fi|War',
       'Adventure', 'Comedy|Crime', 'Action|Sci-Fi|War',
       'Comedy|Fantasy|Romance|Sci-Fi', 'Fantasy',
       'Action|Mystery|Thriller', 'Comedy|Musical',
       'Action|Adventure|Sci-Fi|Thriller', "Children's|Drama|Fantasy",
       'Adventure|War', 'Musical|Romance', 'Comedy|Musical|Romance',
       'Comedy|Mystery|Romance|Thriller', 'Film-Noir|Mystery', 'Musical',
       "Adventure|Children's|Drama|Musical",
       'Drama|Mystery|Sci-Fi|Thriller', 'Romance|Thriller',
       'Film-Noir|Romance|Thriller', 'Crime|Film-Noir|Mystery',
       'Adventure|Comedy', 'Action|Adventure|Romance|War', 'Romance|War',
       'Action|Drama|Western', "Children's|Comedy|Western",
       "Adventure|Children's|Comedy", "Children's|Comedy|Mystery",
       "Adventure|Children's|Fantasy|Sci-Fi",
       "Adventure|Animation|Children's|Musical",
       "Adventure|Children's|Musical", 'Crime|Film-Noir',
       "Adventure|Children's|Comedy|Fantasy",
       "Children's|Drama|Fantasy|Sci-Fi", 'Action|Romance',
       'Adventure|Western', 'Comedy|Fantasy', 'Animation|Comedy',
       'Crime|Drama|Film-Noir', 'Action|Adventure|Drama|Sci-Fi|War',
       'Action|Sci-Fi|Thriller|War', 'Action|Western',
       "Action|Animation|Children's|Sci-Fi|Thriller|War",
       'Action|Adventure|Romance|Sci-Fi|War',
       'Action|Horror|Sci-Fi|Thriller',
       'Action|Adventure|Comedy|Horror|Sci-Fi', 'Action|Comedy|Musical',
       'Mystery|Sci-Fi', 'Film-Noir|Mystery|Thriller',
       'Adventure|Comedy|Drama', 'Action|Adventure|Comedy|Horror',
       'Action|Drama|Mystery|Romance|Thriller', 'Comedy|Mystery|Thriller',
       'Adventure|Animation|Sci-Fi|Thriller', 'Action|Drama|Romance',
       'Action|Adventure|Drama', 'Comedy|Drama|Musical',
       'Documentary|War', 'Drama|Musical|War', 'Action|Horror',
       'Horror|Romance', 'Action|Comedy|Sci-Fi|War', 'Crime|Drama|Sci-Fi',
       'Action|Romance|War', 'Action|Comedy|Crime|Drama',
       'Action|Drama|Thriller|War', "Action|Adventure|Children's",
       "Action|Adventure|Children's|Fantasy",
       "Adventure|Animation|Children's|Comedy|Musical",
       'Crime|Drama|Mystery', 'Action|Adventure|Comedy|Sci-Fi',
       "Children's|Fantasy", 'Action|Mystery|Sci-Fi|Thriller',
       'Action|Mystery|Romance|Thriller', 'Adventure|Thriller',
       'Action|Thriller|War', 'Action|Crime|Mystery',
       'Horror|Mystery|Thriller', 'Crime|Horror|Mystery|Thriller',
       'Comedy|Drama|Thriller', 'Drama|Sci-Fi|Thriller',
       'Drama|Romance|Thriller', 'Action|Adventure|Sci-Fi|War',
       'Comedy|Crime|Drama|Mystery', 'Comedy|Crime|Mystery|Thriller',
       'Film-Noir|Sci-Fi|Thriller', 'Adventure|Sci-Fi|Thriller',
       'Crime|Drama|Mystery|Thriller', 'Comedy|Documentary',
       'Documentary|Musical', 'Action|Drama|Sci-Fi|Thriller',
       "Adventure|Animation|Children's|Fantasy",
       'Adventure|Comedy|Romance', 'Mystery|Sci-Fi|Thriller',
       'Action|Comedy|Crime', "Animation|Children's|Fantasy|War",
       'Action|Crime|Drama|Thriller', 'Comedy|Sci-Fi|Western',
       "Children's|Fantasy|Musical", 'Fantasy|Sci-Fi',
       "Children's|Comedy|Sci-Fi", "Action|Adventure|Children's|Comedy",
       "Adventure|Children's|Drama|Romance",
       "Adventure|Children's|Sci-Fi",
       "Adventure|Children's|Comedy|Fantasy|Sci-Fi",
       "Animation|Children's|Comedy|Musical|Romance",
       "Children's|Musical", 'Drama|Fantasy',
       "Animation|Children's|Fantasy|Musical", 'Adventure|Comedy|Musical',
       "Children's|Sci-Fi", "Children's|Horror", 'Comedy|Fantasy|Romance',
       'Comedy|Crime|Thriller', "Adventure|Animation|Children's|Sci-Fi",
       'Action|Crime|Mystery|Thriller', 'Adventure|Musical',
       "Animation|Children's|Drama|Fantasy", "Children's|Fantasy|Sci-Fi",
       'Adventure|Fantasy|Romance', 'Crime|Horror',
       'Action|Adventure|Horror', 'Adventure|Fantasy|Sci-Fi',
       'Drama|Film-Noir|Thriller', 'Action|Comedy|Fantasy',
       'Sci-Fi|Thriller|War', 'Action|Adventure|Sci-Fi|Thriller|War',
       'Action|Adventure|Drama|Thriller', 'Crime|Horror|Thriller',
       'Animation|Musical', 'Action|War',
       'Action|Comedy|Romance|Thriller', 'Comedy|Horror|Thriller',
       'Drama|Horror|Thriller', 'Action|Sci-Fi|Thriller|Western',
       'Drama|Romance|Sci-Fi', 'Action|Adventure|Horror|Thriller',
       'Comedy|Film-Noir|Thriller', 'Comedy|Horror|Musical|Sci-Fi',
       'Comedy|Romance|Sci-Fi', 'Action|Comedy|Sci-Fi|Thriller',
       'Action|Sci-Fi|Western', 'Comedy|Horror|Musical', 'Crime|Mystery',
       'Animation|Mystery', 'Action|Horror|Thriller',
       'Action|Drama|Fantasy|Romance', 'Horror|Mystery',
       "Adventure|Animation|Children's", 'Musical|Romance|War',
       'Adventure|Drama|Romance', 'Adventure|Animation|Film-Noir',
       'Action|Adventure|Animation', 'Comedy|Drama|Western',
       'Adventure|Comedy|Sci-Fi', 'Drama|Romance|Western',
       'Comedy|Drama|Sci-Fi', 'Action|Drama|Romance|Thriller',
       'Adventure|Romance|Sci-Fi', 'Film-Noir|Horror',
       'Crime|Drama|Film-Noir|Thriller', 'Action|Adventure|War',
       'Romance|Western', "Action|Children's|Fantasy",
       'Adventure|Drama|Thriller', 'Adventure|Fantasy', 'Musical|War',
       'Adventure|Musical|Romance', 'Action|Romance|Sci-Fi',
       'Drama|Film-Noir', 'Comedy|Horror|Sci-Fi',
       'Adventure|Drama|Romance|Sci-Fi', 'Adventure|Animation|Sci-Fi',
       'Adventure|Crime|Sci-Fi|Thriller'], dtype=object)

In [3]:
len(m.genres.unique())

301

In [4]:
m.genres.value_counts().head(10)

Drama             843
Comedy            521
Horror            178
Comedy|Drama      162
Comedy|Romance    142
Drama|Romance     134
Documentary       116
Thriller          101
Action             65
Drama|Thriller     63
Name: genres, dtype: int64

Dramas is the most popular genres.  
How many movies in the "Comedy|Romance|Thriller" category?

In [5]:
crt = m.loc[ m.genres == 'Comedy|Romance|Thriller' ]
print(len(crt))

3

In [6]:
crt

     movie_id                                title                   genres
539       543  So I Married an Axe Murderer (1993)  Comedy|Romance|Thriller
583       587                         Ghost (1990)  Comedy|Romance|Thriller
921       933              To Catch a Thief (1955)  Comedy|Romance|Thriller

In [7]:
u.head()

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [8]:
len(u), len(r)

(6040, 1000209)

In [9]:
r.head(10)

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291
5        1      1197       3  978302268
6        1      1287       5  978302039
7        1      2804       5  978300719
8        1       594       4  978302268
9        1       919       4  978301368

In [10]:
m.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [11]:
m.loc[ m.movie_id == 1193 ]

      movie_id                                   title genres
1176      1193  One Flew Over the Cuckoo's Nest (1975)  Drama

In [12]:
m.loc[ m.movie_id == 661 ]

     movie_id                             title                        genres
655       661  James and the Giant Peach (1996)  Animation|Children's|Musical

In [13]:
m.columns

Index(['movie_id', 'title', 'genres'], dtype='object')

In [14]:
u.columns

Index(['user_id', 'gender', 'age', 'occupation', 'zip'], dtype='object')

In [15]:
r.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [16]:
len(m), len(r)

(3883, 1000209)

In [17]:
mr = pandas.merge(m, r)

In [18]:
len(mr)

1000209

In [19]:
mr.head()

,movie_id,title,genres,user_id,rating,timestamp
0,1,Toy Story (1995),Animation|Children's|Comedy,1,5,978824268
1,1,Toy Story (1995),Animation|Children's|Comedy,6,4,978237008
2,1,Toy Story (1995),Animation|Children's|Comedy,8,4,978233496
3,1,Toy Story (1995),Animation|Children's|Comedy,9,5,978225952
4,1,Toy Story (1995),Animation|Children's|Comedy,10,5,978226474

In [20]:
mr.columns

Index(['movie_id', 'title', 'genres', 'user_id', 'rating', 'timestamp'], dtype='object')

In [21]:
u.columns

Index(['user_id', 'gender', 'age', 'occupation', 'zip'], dtype='object')

In [22]:
df = pandas.merge(u, mr)

In [23]:
df.head()

,user_id,gender,age,occupation,zip,movie_id,title,genres,rating,timestamp
0,1,F,1,10,48067,1,Toy Story (1995),Animation|Children's|Comedy,5,978824268
1,1,F,1,10,48067,48,Pocahontas (1995),Animation|Children's|Musical|Romance,5,978824351
2,1,F,1,10,48067,150,Apollo 13 (1995),Drama,5,978301777
3,1,F,1,10,48067,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,4,978300760
4,1,F,1,10,48067,527,Schindler's List (1993),Drama|War,5,978824195

In [24]:
len(df)

1000209

How many reviews done by the 1 age group? What is the most popular age group?

In [25]:
len(df.loc[ df.age == 1])

27211

In [26]:
df.age.unique()

array([ 1, 56, 25, 45, 50, 35, 18])

So, there are 7 age groups.

In [27]:
df.age.value_counts()

25    395556
35    199003
18    183536
45     83633
50     72490
56     38780
1      27211
Name: age, dtype: int64

25 is the most popular age group.
How many reviews are done by users less than 35?

In [28]:
len( df.loc[ df.age < 35 ])

606303

How many reviews are done by females who are less than 35?

In [29]:
len( df.loc[ (df.age < 35) & (df.gender == 'F')])

145594

In [30]:
len( df.loc[ (df.age < 35) & (df.gender == 'M')])

460709

About 3 times more men under 35 reviewed than women under 35.

In [31]:
len(df)

1000209

Which movies have the most 5 stars reviews?

In [32]:
fives = df.loc[ df.rating == 5 ]

In [33]:
count = fives.title.value_counts()
for i in range(3):
    print(i, count.iloc[i], count.index[i])

0 1963 American Beauty (1999)
1 1826 Star Wars: Episode IV - A New Hope (1977)
2 1500 Raiders of the Lost Ark (1981)

Which movies are most highly rated?

In [34]:
titles = df.groupby('title')

In [35]:
len(titles)

3706

In [36]:
type(titles)

pandas.core.groupby.groupby.DataFrameGroupBy

In [37]:
type(titles.groups)

dict

In [38]:
titles.groups['American Beauty (1999)']

Int64Index([    154,     222,     412,     502,     666,     772,    1121,
               1310,    1483,    1644,
            ...
             994322,  995051,  995689,  995874,  996585,  997057,  997917,
             999342,  999684, 1000149],
           dtype='int64', length=3428)

In [39]:
df.iloc[154]

user_id                            2
gender                             M
age                               56
occupation                        16
zip                            70072
movie_id                        2858
title         American Beauty (1999)
genres                  Comedy|Drama
rating                             4
timestamp                  978298434
Name: 154, dtype: object

In [40]:
df.iloc[222]

user_id                            3
gender                             M
age                               25
occupation                        15
zip                            55117
movie_id                        2858
title         American Beauty (1999)
genres                  Comedy|Drama
rating                             4
timestamp                  978297039
Name: 222, dtype: object

In [41]:
titles = df.groupby('title')

In [42]:
type(titles)

pandas.core.groupby.groupby.DataFrameGroupBy

In [43]:
titles = df.groupby('title')

In [44]:
titles = df.groupby('title').mean()

In [45]:
type(titles)

pandas.core.frame.DataFrame

In [46]:
titles.head()

,user_id,age,occupation,movie_id,rating,timestamp
title,,,,,,
"$1,000,000 Duck (1971)",2865.432432,31.162162,7.378378,2031.0,3.027027,9.782423e+08
'Night Mother (1986),3231.714286,33.271429,6.242857,3112.0,3.371429,9.715184e+08
'Til There Was You (1997),2729.769231,28.826923,7.903846,779.0,2.692308,9.728025e+08
"'burbs, The (1989)",2954.333333,27.897690,8.148515,2072.0,2.910891,9.718751e+08
...And Justice for All (1979),3173.246231,35.984925,8.010050,3420.0,3.713568,9.707617e+08

In [47]:
titles.max()

user_id       5.938000e+03
age           5.600000e+01
occupation    2.000000e+01
movie_id      3.952000e+03
rating        5.000000e+00
timestamp     1.036452e+09
dtype: float64

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df.head()

,user_id,gender,age,occupation,zip,movie_id,title,genres,rating,timestamp
0,1,F,1,10,48067,1,Toy Story (1995),Animation|Children's|Comedy,5,978824268
1,1,F,1,10,48067,48,Pocahontas (1995),Animation|Children's|Musical|Romance,5,978824351
2,1,F,1,10,48067,150,Apollo 13 (1995),Drama,5,978301777
3,1,F,1,10,48067,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,4,978300760
4,1,F,1,10,48067,527,Schindler's List (1993),Drama|War,5,978824195

In [50]:
a = df.gender == 'M'

In [51]:
type(a)

pandas.core.series.Series

In [52]:
a.head()

0    False
1    False
2    False
3    False
4    False
Name: gender, dtype: bool

In [53]:
a.sample(10)

307770     True
487866     True
140553     True
775593    False
584329     True
863774     True
304634    False
794685    False
598063     True
10255      True
Name: gender, dtype: bool

In [54]:
g = df.gender

In [55]:
df.head()

,user_id,gender,age,occupation,zip,movie_id,title,genres,rating,timestamp
0,1,F,1,10,48067,1,Toy Story (1995),Animation|Children's|Comedy,5,978824268
1,1,F,1,10,48067,48,Pocahontas (1995),Animation|Children's|Musical|Romance,5,978824351
2,1,F,1,10,48067,150,Apollo 13 (1995),Drama,5,978301777
3,1,F,1,10,48067,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,4,978300760
4,1,F,1,10,48067,527,Schindler's List (1993),Drama|War,5,978824195

In [56]:
gender_age = df[ ['gender', 'age'] ]
gender_age.head()

  gender  age
0      F    1
1      F    1
2      F    1
3      F    1
4      F    1

In [57]:
gender = df[ df.gender=='M' ]
gender.head()

,user_id,gender,age,occupation,zip,movie_id,title,genres,rating,timestamp
53,2,M,56,16,70072,21,Get Shorty (1995),Action|Comedy|Drama,1,978299839
54,2,M,56,16,70072,95,Broken Arrow (1996),Action|Thriller,2,978300143
55,2,M,56,16,70072,110,Braveheart (1995),Action|Drama|War,5,978298625
56,2,M,56,16,70072,163,Desperado (1995),Action|Romance|Thriller,4,978299809
57,2,M,56,16,70072,165,Die Hard: With a Vengeance (1995),Action|Thriller,3,978300002

In [58]:
df2 = df.sample(5)
df2

,user_id,gender,age,occupation,zip,movie_id,title,genres,rating,timestamp
66265,442,M,25,1,55105,3917,Hellraiser (1987),Horror,4,978455106
322083,1912,M,25,4,91325,900,"American in Paris, An (1951)",Musical|Romance,3,1014483445
500254,3072,M,50,1,55126,1246,Dead Poets Society (1989),Drama,4,969941054
644279,3882,M,56,14,55337,3006,"Insider, The (1999)",Drama,5,967034331
371480,2172,M,18,20,60641,122,Boomerang (1992),Comedy|Romance,2,974668253

In [59]:
df2.loc[518875]

KeyError: 'the label [518875] is not in the [index]'

### What are the highest rated movies?

We'll answer this question using "groupby" and "aggregate".

In [ ]:
df2 = df.groupby('title')
average_rating = df2[['rating']].mean()
sorted_rating = average_rating.sort_values(by='rating', ascending=False)
sorted_rating.head()

In [ ]:
len(df[ df.title == 'Ulysses (Ulisse) (1954)' ])

### What are best movies?

(A)
look at 5 stars movies
sort them by count

(B)
- highly rated.  (sort by rating)
- rated many times. (reviewed by at least 500 people)

In [ ]:
fivestars = df[ df.rating == 5 ]
fivestars.title.value_counts().head(10)

In [ ]:
average = df.groupby('title')[['rating']].mean()
average.head()

In [ ]:
count = df.groupby('title')[['rating']].count()
count.head()

In [ ]:
(count.rating > 100).head()

In [ ]:
average = df.groupby('title')[['rating']].mean()
popular_movies = average[ count.rating > 1000 ].sort_values(by='rating',ascending=False)
popular_movies.head(10)

In [ ]:
### Which

df.head()

In [ ]:
df.groupby('gender')[['rating']].mean()

In [ ]:
df.groupby(['gender','title'])[['rating']].mean().head(20)